app/controllers/search_controller.rb

  def chat
    @chat = User.all
---
SELECT "users".* FROM "users"