app/controllers/sessions_controller.rb

  def create
    reset_session

    #super_user = Super_user.all
    #if (session_params[:mem_info] == super_user.super_user_name) && (session_params[:mem_password] == super_user.super_user_password)

    #  session[:suoer_user_id] = super_user.id
    #  redirect_to "/super_users", notice: 'ログインしました'

    #end

    user = User.find_by(mem_info: session_params[:mem_info])
---
SELECT  "users".* FROM "users" WHERE "users"."mem_info" = $1 LIMIT $2  [["mem_info", "aaass"], ["LIMIT", 1]]