app/controllers/user_pages_controller.rb

  def index
    if current_user
      @user = current_user
      @company_offers = CompanyOffer.where(mem_id: current_user)
      @company_offers.each do |company_offer|
        @companys = Company.where(id: company_offer.com_id)
      end
  elsif current_company
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]