app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    unless @user.mem_birth.nil?
      unless @user.mem_gra.nil?
        if @user.mem_birth > @user.mem_gra.years_ago(20)
          redirect_to new_user_path, notice:"誕生日と卒業年に誤りがあります"and return
        end
      end
    end


    if @user.save
---
INSERT INTO "users" ("mem_name", "user_name", "mem_info", "des_occupation", "des_location", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"